app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Glen Latest article"], ["text", "This is my last article"], ["created_at", "2018-06-30 23:09:35.814612"], ["updated_at", "2018-06-30 23:09:35.814612"]]
---
  def create
    # render plain: params[:article].inspect
    @article = Article.new(article_params)

    if @article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "articles" SET "text" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["text", "this is the 3rd-edited article"], ["updated_at", "2018-06-30 22:26:11.369922"], ["id", 2]]
---
  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)